library/app/Controllers/Home.php

INSERT INTO `tbl_users` (`user_name`, `email_id`, `phone_no`, `user_password`, `role`) VALUES ('swetha', 'swetha@gmail.com', '9087654321', '95c0aef0849cb388df03f98f76ad26e9', 1)
---
    public function registeruser()
    {
        $db = db_connect();
        $builder = $db->table('tbl_users');
        $data = [];

        $name = $this->request->getPost('uename');
        $email = $this->request->getPost('eid');
        $phone = $this->request->getPost('pno');
        $password = md5($this->request->getPost('pas'));
        $role = $this->request->getPost('role');
        if ($role == 'Student') {
            $role = 1;
        } else {
            $role = 0;
        }


        $data = [
            'user_name' => $name,
            'email_id' => $email,
            'phone_no' => $phone,
            'user_password' => $password,
            'role' => $role

        ];



        $builder->insert($data);